[
  {
    "id": "1mzim2n",
    "subreddit": "gaming",
    "title": "Making Friends Monday! Share your game tags here!",
    "score": 8,
    "num_comments": 15,
    "selftext": "Use this post to look for new friends to game with! Share your gamer tag & platform, and meet new people! \n\nThis thread is posted weekly on Mondays (adjustments made as needed)."
  },
  {
    "id": "1mn55hx",
    "subreddit": "gaming",
    "title": "Making Friends Monday! Share your game tags here!",
    "score": 8,
    "num_comments": 20,
    "selftext": "Use this post to look for new friends to game with! Share your gamer tag & platform, and meet new people! \n\nThis thread is posted weekly on Mondays (adjustments made as needed)."
  },
  {
    "id": "1n2c6ds",
    "subreddit": "gaming",
    "title": "‘Marvel Rivals’ And ‘Overwatch 2’ Are Tied On Steam After Big Rivals Declines",
    "score": 4109,
    "num_comments": 1259,
    "selftext": ""
  },
  {
    "id": "1n2djgk",
    "subreddit": "gaming",
    "title": "I hope Sam Lake gets the recognition he deserves someday. Both Control and Alan Wake 2 are the some of the most creatively directed and crafted games I've ever played. Genuinely one of a kind gameplay experiences",
    "score": 2968,
    "num_comments": 238,
    "selftext": ""
  },
  {
    "id": "1n2nwgx",
    "subreddit": "gaming",
    "title": "Swedish devs this year 🇸🇪",
    "score": 679,
    "num_comments": 68,
    "selftext": ""
  },
  {
    "id": "1n2k0zc",
    "subreddit": "gaming",
    "title": "Remember in The Darkness on PS3, you could watch the entire To Kill a Mockingbird? Blu-ray was new, and a full film on a game disc was wild.",
    "score": 1030,
    "num_comments": 73,
    "selftext": "Yes, I’m watching the whole movie."
  },
  {
    "id": "1n28o3j",
    "subreddit": "gaming",
    "title": "It Costs $70 To Buy Hitman On iOS",
    "score": 3803,
    "num_comments": 307,
    "selftext": ""
  },
  {
    "id": "1n2ib9y",
    "subreddit": "gaming",
    "title": "Sony is reportedly planning a Nintendo Switch-style PlayStation 6 portable",
    "score": 740,
    "num_comments": 308,
    "selftext": ""
  },
  {
    "id": "1n1vswb",
    "subreddit": "gaming",
    "title": "In my 42 years, I have never seen such an obscure config option.  (Quartet, PC)",
    "score": 15986,
    "num_comments": 536,
    "selftext": "Definitely \"on.\""
  },
  {
    "id": "1n2elpd",
    "subreddit": "gaming",
    "title": "I made the M98-Widow from Mass Effect",
    "score": 463,
    "num_comments": 23,
    "selftext": "Made f"
  },
  {
    "id": "1n1z2v9",
    "subreddit": "gaming",
    "title": "Sean Murray says the Earth-sized planet in Light No Fire will have 'real oceans' that players will need 'large boats and crews' to cross",
    "score": 5008,
    "num_comments": 704,
    "selftext": "Kinda sounds like Light No Fire will be the world sized RPG I've been waiting for since I was a kid. "
  },
  {
    "id": "1n2bjip",
    "subreddit": "gaming",
    "title": "What type of games are not your \"cup of tea\"?",
    "score": 503,
    "num_comments": 1336,
    "selftext": "For me MOBA and competive online shooters"
  },
  {
    "id": "1n28zzx",
    "subreddit": "gaming",
    "title": "Dino Crisis Remake Was Attempted Twice In The Past Few Years, But Projects Were Scrapped Due to Quality - Rumor",
    "score": 380,
    "num_comments": 100,
    "selftext": ""
  },
  {
    "id": "1n1uns5",
    "subreddit": "gaming",
    "title": "Dramatization: may not have happened (Hollow Knight)",
    "score": 3350,
    "num_comments": 34,
    "selftext": ""
  },
  {
    "id": "1n2ejsc",
    "subreddit": "gaming",
    "title": "Red Dead Redemption 2, what little detail in a game world made you stop and just admire it?",
    "score": 103,
    "num_comments": 135,
    "selftext": "One thing I’ll never forget in *Red Dead Redemption 2* is how alive the world feels. It wasn’t even the big missions that hooked me, it was the small details. Like sitting by the campfire listening to NPCs tell random stories, or stumbling on a stranger in the middle of nowhere.\n\nIt made me realize that sometimes the “small” things are what truly immerse you in a game world.\n\nFor you, what’s that one little detail in any game that blew you away and made you just stop and admire it?"
  },
  {
    "id": "1n26ea7",
    "subreddit": "gaming",
    "title": "Crystal Dynamics Announces Layoffs; New Tomb Raider Game Is Unaffected",
    "score": 348,
    "num_comments": 39,
    "selftext": ""
  },
  {
    "id": "1n25td6",
    "subreddit": "gaming",
    "title": "It's my birthday and I got the most appropriate card, LOL",
    "score": 363,
    "num_comments": 41,
    "selftext": "#funny\n\n\n"
  },
  {
    "id": "1n1h4dq",
    "subreddit": "gaming",
    "title": "And it happened again!! No Man's Sky with 39th free major update!! Over nine years old game still releasing new huge content.",
    "score": 13620,
    "num_comments": 993,
    "selftext": ""
  },
  {
    "id": "1n1zy5p",
    "subreddit": "gaming",
    "title": "Elden Ring Superfan Alex Garland Put Together a 160-Page Draft Script – With 40 Extra Pages of Images – to Convince Hidetaka Miyazaki to Let Him Direct the Movie",
    "score": 887,
    "num_comments": 93,
    "selftext": ""
  },
  {
    "id": "1n2f4wh",
    "subreddit": "gaming",
    "title": "40K Space Marine 2 - Year 2 Trailer",
    "score": 75,
    "num_comments": 21,
    "selftext": ""
  },
  {
    "id": "1n2kivx",
    "subreddit": "gaming",
    "title": "What are some your core gaming memories?",
    "score": 29,
    "num_comments": 117,
    "selftext": "What are some gaming memories you have that have stayed with you and that feel especially meaningful to you.\n\nFor me it was pulling out the master sword in ocarina of time, blighttown in dark souls and more recently figuring out fulgora in factorio."
  },
  {
    "id": "1n1h8xt",
    "subreddit": "gaming",
    "title": "Microsoft is reportedly mandating that every single employee at King (Candy Crush) has to use AI on a daily basis",
    "score": 6395,
    "num_comments": 402,
    "selftext": ""
  },
  {
    "id": "1n2oy55",
    "subreddit": "gaming",
    "title": "I might not be THAT bad at games… (Celeste)",
    "score": 13,
    "num_comments": 9,
    "selftext": "…i will however be giving up now.\n\nI did start Farewell and made it to the 2nd room of the wave jump tutorial (and the first room of B-side Core is pure agony), but i just can’t anymore…\n\nAnd hey! getting that far isn’t too bad, right?\n\nCan’t believe I’m actually tearing up at not being able to beat a game 🥹😅 and at least i get to play Helldivers now 😊"
  },
  {
    "id": "1n1xas1",
    "subreddit": "gaming",
    "title": "Hirogami Devs Announce The Game Wont Be Delayed Because Of Silksong Despite Launching The Day Before",
    "score": 606,
    "num_comments": 32,
    "selftext": ""
  },
  {
    "id": "1n1odw6",
    "subreddit": "gaming",
    "title": "Gears Of War: Reloaded Opens To \"Mixed\" Steam Reviews Over Game-Breaking Bugs, Missing Pre-Order Items, And Lack Of Split Screen Co-Op",
    "score": 1350,
    "num_comments": 226,
    "selftext": ""
  },
  {
    "id": "1n1e4d4",
    "subreddit": "gaming",
    "title": "Helldivers 2 Reaches Highest Ever Playercount Since Launch (500,000) After Halo DLC And Xbox Release",
    "score": 4744,
    "num_comments": 425,
    "selftext": ""
  },
  {
    "id": "1n1q3fw",
    "subreddit": "gaming",
    "title": "\"Your evil has claimed the lives of many good men. No longer.\" - Viktor Reznov",
    "score": 856,
    "num_comments": 146,
    "selftext": "It was a good run, but I just can't do it anymore gentlemen. I know it has been like this for a while, but something about the latest iteration was a slap in the face. My war ends with you."
  },
  {
    "id": "1n16uzo",
    "subreddit": "gaming",
    "title": "My 14yo son is playing through FFVII for the first time. He just said, \"I'll go find that other secret character after I get Aeris back in my party. I don't think I could make it without her.\" I just let the school know he won't be able to make it tomorrow.",
    "score": 19348,
    "num_comments": 719,
    "selftext": ""
  },
  {
    "id": "1n1pq5a",
    "subreddit": "gaming",
    "title": "Nintendo Switch 2 Surpasses 2 Million U.S. Sales, Outpaces Original by 75 Percent",
    "score": 670,
    "num_comments": 425,
    "selftext": ""
  },
  {
    "id": "1n1cmu4",
    "subreddit": "gaming",
    "title": "Star Citizen boss hopes single-player Squadron 42 will be “almost as big an event” as GTA 6, which is impossible",
    "score": 2867,
    "num_comments": 867,
    "selftext": ""
  },
  {
    "id": "1n23gx0",
    "subreddit": "gaming",
    "title": "Now that Shinobi and Ninja Gaiden are getting amazing reviews, we can look back at this and say that 90's ninja era are fucking back!",
    "score": 74,
    "num_comments": 29,
    "selftext": ""
  },
  {
    "id": "1n1efnq",
    "subreddit": "gaming",
    "title": "\"This Is Not The End\": Clair Obscur: Expedition 33 Director Teases A Potential Sequel Or DLC",
    "score": 1489,
    "num_comments": 162,
    "selftext": ""
  },
  {
    "id": "1n1unam",
    "subreddit": "gaming",
    "title": "What are the \"meh\" games that turned out to be amazing in your experience?",
    "score": 198,
    "num_comments": 502,
    "selftext": "I know reviews exist for a reason, and for the most part, are usually a good indicator on whether or not I should spend money on a game.\n\nBut then there are the times I'm glad I didn't listen to the reviews or what my friends tell me to avoid.\n\nSome games that pleasantly come to mind despite the \"meh\" or negative reviews that I actually really enjoyed are:\n\n-Days Gone\n-Marvels Midnight Suns\n-Gotham Knights\n\nWhat have been your, \"meh\" gems?"
  },
  {
    "id": "1n1flum",
    "subreddit": "gaming",
    "title": "DMC Director Confirms His New AAA Game Won’t Be A Soulslike: “I Didn’t Create A Company To Make A High-End Version Of Existing Games With Simmilar Gameplay, Story, And Character Design”",
    "score": 990,
    "num_comments": 214,
    "selftext": ""
  },
  {
    "id": "1n2pgob",
    "subreddit": "gaming",
    "title": "KCD2",
    "score": 2,
    "num_comments": 1,
    "selftext": "Just finished this game and I don’t throw this around lightly…..this is officially my favorite game of all time. "
  },
  {
    "id": "1n1h51c",
    "subreddit": "gaming",
    "title": "33 years ago on August 27th, Super Mario Kart was first released in (for Super Famicom in Japan).",
    "score": 439,
    "num_comments": 50,
    "selftext": "I'd like to celebrate the first great step of the hugely popular series that continues to this day!\n\nMany of the important elements that make up Mario Kart were in place at the time of this first game.\n\nIncidentally, in the early stages of development, the plan was to create a two-player version of \"F-ZERO\" that had nothing to do with \"Mario.\""
  },
  {
    "id": "1n1cdxn",
    "subreddit": "gaming",
    "title": "I’m bad a games so i’m bragging about getting all the strawberries :3",
    "score": 754,
    "num_comments": 68,
    "selftext": ""
  },
  {
    "id": "1n2of5u",
    "subreddit": "gaming",
    "title": "Your favorite ballads in games?",
    "score": 1,
    "num_comments": 10,
    "selftext": "Whenever I see people talk about their favorite vocal tracks I often see a lot of pop and rock music, like a good amount of Devil May Cry’s and Persona music. Which I love as well.\n\nBut recently I’ve realized I have a tendency to grow more attached to scenes that utilize a ballad to accompany it. No coincidence that they are usually used at the endings. So I was wondering if any of you had some good ballads with vocals from games and if you want any reasons why it may have resonated with you. \n\nAlso I may be using the genre “ballad” wrong. I understand it as a slow, dramatic, and somewhat tells a narrative itself.  \n\nFor me:\n\nGod and Man - God Eater\n\nMaybe Tomorrow - Xenosaga Episode III \n\nOne Last You - Xenoblade Chronicles 2\n\nNo Promises to Keep - FF7 Rebirth\n\nWithout You - Shadow Generations\n\nAmber Journey - Code Vein\n"
  },
  {
    "id": "1n1hf2w",
    "subreddit": "gaming",
    "title": "No Man's Sky Voyagers Update - Deep Dive",
    "score": 250,
    "num_comments": 147,
    "selftext": ""
  },
  {
    "id": "1n23dnr",
    "subreddit": "gaming",
    "title": "Yars Revenge and Rush",
    "score": 15,
    "num_comments": 6,
    "selftext": "So I buy Yars: Recharged, a great updated version of Yars Revenge from '82 that I just heard about, and wander to the Achievement list, and lo and behold, what a great surprise, they're all named after Rush songs!  \nMan, I wonder what's ahead now."
  },
  {
    "id": "1n0xk41",
    "subreddit": "gaming",
    "title": "I personally don't believe them",
    "score": 4672,
    "num_comments": 686,
    "selftext": ""
  },
  {
    "id": "1n1yni0",
    "subreddit": "gaming",
    "title": "What genre do you feel has been somewhat forgotten?",
    "score": 22,
    "num_comments": 114,
    "selftext": "For me, I really wish there were more trading card games that focused on the story/adventure. \n\nI have vivid memories of playing Yu-Gi-Oh Forbidden Memories or Duelist of the Roses where you would make your way through, collecting cards, grinding for cool decks, etc. \n\nI'm also a huge fan of games that have a full on card collecting game built into them, something like Gwent from The Witcher, Final Fantasy 8, etc. Horizon Forbidden West even had it's own thing, sort of similar but were not cards. \n\nAlso, aware there are games like Slay the Spire, etc that also contain \"cards\" in the sense of abilities, or other games like Balatro - although they're not quite the same. "
  },
  {
    "id": "1n1taml",
    "subreddit": "gaming",
    "title": "A collection of gaming-related things I've designed and 3D Printed this year!",
    "score": 42,
    "num_comments": 9,
    "selftext": ""
  },
  {
    "id": "1n0obiq",
    "subreddit": "gaming",
    "title": "I modded RDR2 to make Jack Marston a throwable weapon",
    "score": 10378,
    "num_comments": 155,
    "selftext": ""
  },
  {
    "id": "1n0sy49",
    "subreddit": "gaming",
    "title": "This feels illegal",
    "score": 3892,
    "num_comments": 436,
    "selftext": ""
  },
  {
    "id": "1n12lxs",
    "subreddit": "gaming",
    "title": "Hideaki Itsuno explains why he left Capcom. Didn't want to just make DMC and DD sequels for the rest of his career",
    "score": 1089,
    "num_comments": 129,
    "selftext": "\"For me, based on my age, this is my last chance,\" Itsuno told VGC during a recent visit to his new studio, Lightspeed Japan, where he was given the opportunity to build an entirely new team and project by owner Tencent. \"The gaming industry has decreased the number of AAA releases, and I was asked to create a new AAA. I'm not young anymore, so more than 'now it's the right moment' it's more like, 'this is my last chance' to challenge myself.\"  \n  \nHe continued: \"For Capcom, creating Devil May Cry and Dragon's Dogma sequels is the top priority, and keeping in mind that making a game takes four or five years, this might be my last big opportunity.\n\nBefore you realized you are working on making the Devil May Cry 6 or 7. It's not like I don't want to make them, I do, but it's hard to balance the time it takes with the personal satisfaction of making them, and with Devil May Cry 5 and Dragon's Dogma 2, I already did what I wanted to make.\"\n\n  \nInsert joke about not even finishing DD2 below."
  },
  {
    "id": "1n2c8ke",
    "subreddit": "gaming",
    "title": "MGS Peace Walker on PS Vita",
    "score": 0,
    "num_comments": 15,
    "selftext": "Hi. \n\nSo I booted up my vita after almost a decade. I really want to play MGS Peace Walker once I finish MGS Delta on console.\nI just downloaded Peace Walker. It was cheap as well. I downloaded the PSP version off of the store. There were no other MGS versions (HD collection, etc).\nMy question is, how the hell do I remap the controls. The camera is controlled with the face buttons! WTH 🤦‍♂️. I know it was because of PSP, but which psychopath thought this was a good idea!\nI know it was originally on PSP, but can I in any way modify the controls so the snalog sticks work like a normal game? Left to move and right for camera. Face buttons for combat, action, etc....\nHonestly, I would assume it being on Vita it would automatically register!\nThe touch screen function doesn't even work with this game.\n\n\nPlease help, anyone. I've you can.  I would really appreciate it. "
  },
  {
    "id": "1n2o9sd",
    "subreddit": "gaming",
    "title": "Forgive me lord for i am weak (i was one year sober god damn it).",
    "score": 0,
    "num_comments": 16,
    "selftext": "https://preview.redd.it/uwlg0natrtlf1.png?width=2560&format=png&auto=webp&s=df6c1c8d421ed78690313b1fee35b51b6003b7ab\n\nOpened the game to see what was new, next thing you know you've been there for hours wandering like an idiot, looking at stuff, building stuff.\n\nThis is worst than any \"real\" drug."
  },
  {
    "id": "1n0rs6t",
    "subreddit": "gaming",
    "title": "Hellraiser PS5's Sexual Horror Is Pushing Its M Rating to the Max",
    "score": 1544,
    "num_comments": 187,
    "selftext": ""
  },
  {
    "id": "1n0obqy",
    "subreddit": "gaming",
    "title": "Hollow Knight speedrunner records secret Silksong speedrun to hold the World Record for its now-unplayable demo",
    "score": 2115,
    "num_comments": 70,
    "selftext": ""
  }
]